#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
aws_cloudwatch_log_group.srv_cad_imoveis: Refreshing state... [id=/ecs/real-state-java-services-cluster-dev/srv-cad-imoveis]
aws_iam_role.ecs_generic_task_role: Refreshing state... [id=real-state-java-services-ecs-generic-task-role-dev]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.ecs_exec_policy_document: Reading...
aws_cloudwatch_log_group.srv_cad_usuarios: Refreshing state... [id=/ecs/real-state-java-services-cluster-dev/srv-cad-usuarios]
aws_ecr_repository.srv_cad_imoveis: Refreshing state... [id=srv-cad-imoveis]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:cluster/real-state-java-services-cluster-dev]
aws_ecr_repository.srv_cad_usuarios: Refreshing state... [id=srv-cad-usuarios]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=real-state-java-services-ecs-task-execution-role-dev]
aws_vpc.main: Refreshing state... [id=vpc-00a54e9fe3b01942e]
data.aws_iam_policy_document.ecs_exec_policy_document: Read complete after 0s [id=3621793318]
aws_cloudwatch_log_group.srv_cad_company: Refreshing state... [id=/ecs/real-state-java-services-cluster-dev/srv-cad-company]
data.aws_caller_identity.current: Read complete after 0s [id=665290616424]
aws_ecr_repository.srv_cad_company: Refreshing state... [id=srv-cad-company]
aws_iam_role.ecs_srv_cad_company_task_role: Refreshing state... [id=real-state-java-services-ecs-srv-cad-company-task-role-dev]
aws_iam_policy.ecs_exec_policy: Refreshing state... [id=arn:aws:iam::665290616424:policy/real-state-java-services-ecs-exec-policy-dev]
data.aws_iam_policy_document.ecs_dynamodb_cad_company_access: Reading...
data.aws_iam_policy_document.ecs_dynamodb_cad_company_access: Read complete after 0s [id=4048910599]
aws_iam_policy.ecs_dynamodb_cad_company_access: Refreshing state... [id=arn:aws:iam::665290616424:policy/real-state-java-services-ecs-dynamodb-cad-company-policy-dev]
aws_iam_role_policy_attachment.generic_task_role_ecs_exec: Refreshing state... [id=real-state-java-services-ecs-generic-task-role-dev-20250607132455188000000001]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=real-state-java-services-ecs-task-execution-role-dev-20250607120614224900000001]
aws_ecs_task_definition.srv_cad_usuarios: Refreshing state... [id=srv-cad-usuarios-dev]
aws_ecs_task_definition.srv_cad_imoveis: Refreshing state... [id=srv-cad-imoveis-dev]
aws_iam_role_policy_attachment.ecs_srv_cad_company_dynamodb_access: Refreshing state... [id=real-state-java-services-ecs-srv-cad-company-task-role-dev-20250607120614444200000002]
aws_iam_role_policy_attachment.company_task_role_ecs_exec: Refreshing state... [id=real-state-java-services-ecs-srv-cad-company-task-role-dev-20250607132455308700000002]
aws_ecs_task_definition.srv_cad_company: Refreshing state... [id=srv-cad-company-dev]
aws_subnet.public[0]: Refreshing state... [id=subnet-07324031f87827fe2]
aws_lb_target_group.srv_cad_usuarios: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-usuarios-dev/6c912a86f84b538b]
aws_subnet.private[0]: Refreshing state... [id=subnet-0265039c0601fe040]
aws_lb_target_group.srv_cad_company: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-company-dev/6b143a9982607196]
aws_subnet.private[1]: Refreshing state... [id=subnet-08defa6abf0a966b2]
aws_subnet.public[1]: Refreshing state... [id=subnet-0a8bb12d2ed1c6f5e]
aws_internet_gateway.gw: Refreshing state... [id=igw-071b6d49e2db50025]
aws_security_group.alb_sg: Refreshing state... [id=sg-0f4f34896437c0db1]
aws_lb_target_group.srv_cad_imoveis: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-imoveis-dev/41f7b76dddafea35]
aws_eip.nat: Refreshing state... [id=eipalloc-0b117475bb188c4ec]
aws_route_table.public: Refreshing state... [id=rtb-0b1fcde274c3e46e0]
aws_security_group.ecs_tasks_sg: Refreshing state... [id=sg-02f2fce4bd66c07ba]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:loadbalancer/app/real-state-java-services-alb-dev/651de1075ade3e5e]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-055269966a15d6a95]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01a0cee614a727cb7]
aws_ecs_service.srv_cad_usuarios: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-usuarios-dev]
aws_ecs_service.srv_cad_company: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-company-dev]
aws_ecs_service.srv_cad_imoveis: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-imoveis-dev]
aws_nat_gateway.nat: Refreshing state... [id=nat-0a2e053af7b06af73]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener/app/real-state-java-services-alb-dev/651de1075ade3e5e/e64574f6d16b7d0a]
aws_route_table.private: Refreshing state... [id=rtb-051d4217b48ab90b9]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f383fbd8ae66862e]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02832338ea2180e5a]
aws_lb_listener_rule.srv_cad_company: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener-rule/app/real-state-java-services-alb-dev/651de1075ade3e5e/e64574f6d16b7d0a/d2395e008bf7eeb9]
aws_lb_listener_rule.srv_cad_usuarios: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener-rule/app/real-state-java-services-alb-dev/651de1075ade3e5e/e64574f6d16b7d0a/7c240a80e74c37ca]
aws_lb_listener_rule.srv_cad_imoveis: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener-rule/app/real-state-java-services-alb-dev/651de1075ade3e5e/e64574f6d16b7d0a/5117770034b47c07]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.srv_cad_company will be updated in-place
  ~ resource "aws_ecs_service" "srv_cad_company" {
        id                                 = "arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-company-dev"
        name                               = "srv-cad-company-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-company-dev:5" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.srv_cad_imoveis will be updated in-place
  ~ resource "aws_ecs_service" "srv_cad_imoveis" {
        id                                 = "arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-imoveis-dev"
        name                               = "srv-cad-imoveis-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-imoveis-dev:5" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.srv_cad_usuarios will be updated in-place
  ~ resource "aws_ecs_service" "srv_cad_usuarios" {
        id                                 = "arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-usuarios-dev"
        name                               = "srv-cad-usuarios-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-usuarios-dev:14" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.srv_cad_company must be replaced
-/+ resource "aws_ecs_task_definition" "srv_cad_company" {
      ~ arn                      = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-company-dev:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-company-dev" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "srv-cad-company-dev" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.srv_cad_imoveis must be replaced
-/+ resource "aws_ecs_task_definition" "srv_cad_imoveis" {
      ~ arn                      = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-imoveis-dev:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-imoveis-dev" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "srv-cad-imoveis-dev" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.srv_cad_usuarios must be replaced
-/+ resource "aws_ecs_task_definition" "srv_cad_usuarios" {
      ~ arn                      = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-usuarios-dev:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-usuarios-dev" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "srv-cad-usuarios-dev" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_lb_target_group.srv_cad_company will be updated in-place
  ~ resource "aws_lb_target_group" "srv_cad_company" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-company-dev/6b143a9982607196"
        name                               = "srv-cad-company-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (18 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/srv-cad-company/actuator/health" -> "/srv-cad-company/health"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lb_target_group.srv_cad_imoveis will be updated in-place
  ~ resource "aws_lb_target_group" "srv_cad_imoveis" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-imoveis-dev/41f7b76dddafea35"
        name                               = "srv-cad-imoveis-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (18 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/srv-cad-imoveis/actuator/health" -> "/srv-cad-imoveis/health"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lb_target_group.srv_cad_usuarios will be updated in-place
  ~ resource "aws_lb_target_group" "srv_cad_usuarios" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-usuarios-dev/6c912a86f84b538b"
        name                               = "srv-cad-usuarios-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (18 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/health" -> "/srv-cad-usuarios/health"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 6 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>